Repository: Djaler/Formatter
Catalog: po/extra/*.po
Languages: fr, nl, pl, pt

source: Formatter
fr: Formateur
nl: Formatteren

source: Format devices
fr: Formattez des périphériques
nl: Formatteer apparaten
pl: Formatuj urządzenia
pt: Formatar dispositivos

source: Format;Device;USB;
fr: Formater;Périphérique;USB;
nl: Formatteren;Apparaat;USB;
pl: Formatowanie;Urządzenie;USB;
pt: Formatar;Dispositivo;USB;

source: A simple device formatter
fr: Un simple formateur de périphérique
nl: Een eenvoudige apparaatformatteerder
pl: Prosty formater urządzeń
pt: Uma aplicação simples para formatar dispositivos

source: Format your removable devices like usb disk or sd card
fr: Formatez vos périphériques amovibles comme des clés USB ou cartes SD
nl: Formatteer je verwijderbare apparaten (usb-schijf, sd-kaart, etc.)
pl: Formatuj swoje przenośne urządzenia, jak dysk USB czy karta SD
pt: Formate os seus dispositivos removíveis tais como um disco USB ou cartão SD

source: Add partition label limitations
fr: Ajout des limitations pour le nom de partition
nl: Partitielabelbeperkingen toegevoegd
pl: Dodaj ograniczenia etykiety partycji
pt: Adiciona limitações de etiqueta da partição

source: Remove predefined partition label due to limitations
fr: Suppression du nom de partition prédéfini en raison des limitations
nl: Vooringesteld partitielabel verwijderd wegens beperkingen
pl: Usuń predefiniowaną etykietę partycji ze względu na ograniczenia
pt: Remove a etiqueta da partição predefinida devido às limitações

source: Predefined partition label
fr: Nom de partition prédéfini
nl: Vooringesteld partitielabel
pl: Predefiniowana etykieta partycji
pt: Etiqueta da partição predefinida

source: Updated Russian translation
fr: Mise à jour des traductions en russe
nl: Russische vertaling bijgewerkt
pl: Zaktualizowano rosyjskie tłumaczenie
pt: Tradução russa atualizada

source: Minor style improvement
fr: Amélioration graphique mineure
nl: Kleine stijlverbetering
pl: Niewielka poprawa stylu
pt: Pequena melhoria do estilo

source: Check for exit codes
fr: Vérifier les codes de fermeture
nl: Controle op afsluitcodes
pl: Sprawdzanie exit code'ów
pt: Verifique os códigos de saída

source: Set device label
fr: Définir le nom d'un périphérique
nl: Stel apparaatlabels in
pl: Ustawianie etykiety urządzenia
pt: Defina a etiqueta do dispositivo

source: HFS+ support
fr: Prise en charge de HFS+
nl: HFS+-ondersteuning
pl: Wsparcie dla HFS+
pt: Suporte a HFS +

source: FAT16 support
fr: Prise en charge de FAT16
nl: FAT16-ondersteuning
pl: Wsparcie dla FAT16
pt: Suporte a FAT16

source: Icon path fixed
fr: Chemin de l'icône corrigé
nl: Pictogrampad gerepareerd
pl: Naprawiono ścieżkę ikony
pt: Caminho do ícone corrigido

source: Added Lithuanian translate
fr: Ajout des traductions en lituanien
nl: Litouwse vertaling toegevoegd
pl: Dodano litewskie tłumaczenie
pt: Adicionada tradução em lituano

source: Added Russian translate
fr: Ajout des traductions en russe
nl: Russische vertaling toegevoegd
pl: Dodano rosyjskie tłumaczenie
pt: Adicionada tradução em russo

source: Typo fix
fr: Correction typographique
nl: Typfout opgelost
pl: Poprawiona literówka
pt: Correção ortográfica

source: USB 3.0 Support
fr: Prise en charge de l'USB 3.0
nl: USB 3.0-ondersteuning
pl: Wsparcie dla USB 3.0
pt: Suporte a USB 3.0

source: Format to exFAT
fr: Formatage en exFAT
nl: Formatteer naar exFAT
pl: Formatowanie do exFAT
pt: Formatar para exFAT

source: Initial Release
fr: Version initiale
nl: InitiÃ«le uitgave
pl: Początkowe wydanie
pt: Lançamento inicial

source: Format devices to ext4, FAT32 or NTFS
fr: Formattez des périphériques en ext4, FAT32 ou NTFS
nl: Formatteer apparaten naar ext4, FAT32 of NTFS
pl: Formatowanie urządzeń do ext4, FAT32 i NTFS
pt: Formate dispositivos para ext4, FAT32 ou NTFS
